{
  "philosophy_core -> quantum_philosophy": "Эта связь отражает переход от общей философии науки к философскому анализу квантовой механики, где переосмысливаются понятия реальности, причинности и измерения.",
  "philosophy_core -> determinism": "Связь показывает, что детерминизм является одной из ключевых философских позиций, обсуждаемых в рамках философии науки при анализе физических теорий.",
  "philosophy_core -> ontology": "Онтология составляет фундамент философии, поскольку отвечает на вопрос о том, что существует в реальности и какие сущности признаются фундаментальными.",
  "philosophy_core -> epistemology": "Эта связь подчёркивает, что философия науки неотделима от эпистемологии, изучающей природу, границы и способы получения знания.",
  "philosophy_core -> metaphysics": "Метафизика является центральным разделом философии и рассматривает предельные основания бытия, лежащие в основе физических теорий.",
  "philosophy_core -> objective_reality": "Связь отражает философскую постановку вопроса о существовании объективной реальности независимо от наблюдателя и теоретических описаний.",
  "philosophy_core -> dark_matter_ontology": "Онтологический статус тёмной материи требует философского анализа, так как её существование выводится косвенно и ставит вопросы о природе физической реальности.",
  "philosophy_core -> observer_role": "Философия науки анализирует роль наблюдателя в познании, особенно в контексте современных физических теорий.",
  "philosophy_core -> scientific_method": "Связь подчёркивает, что научный метод имеет философские основания, включая критерии истинности, проверяемости и объяснения.",
  "philosophy_core -> time_metaphysics": "Метафизика времени является частью философии и исследует фундаментальную природу времени, его направление и статус в физике.",
  "philosophy_core -> anthropic_principle": "Антропный принцип представляет собой философскую интерпретацию условий существования наблюдателя во Вселенной.",
  "philosophy_core -> relativity_philosophy": "Философия относительности анализирует концептуальные последствия теории относительности для понятий пространства, времени и одновременности.",
  "philosophy_core -> consciousness_philosophy": "Связь отражает философское обсуждение природы сознания и его возможной роли в физическом описании мира.",
  "philosophy_core -> field_nature": "Философия рассматривает вопрос о природе физических полей и их онтологическом статусе.",
  "philosophy_core -> reality_nature": "Эта связь указывает на философское исследование того, что следует считать реальностью в научном и физическом смысле.",
  "philosophy_core -> mathematical_methods": "Философия науки анализирует роль математических методов как инструмента описания и понимания физических законов.",
  "objective_reality -> newton_laws": "Законы Ньютона рассматриваются как описание объективной реальности в рамках классической механики, независимо от наблюдателя.",
  "anthropic_principle -> entropy": "Антропный принцип связывается с понятием энтропии при обсуждении условий, необходимых для возникновения наблюдателей.",
  "time_metaphysics -> thermodynamics": "Термодинамика вводит направление времени через рост энтропии, что напрямую связано с метафизикой времени.",
  "field_nature -> maxwell_eq": "Уравнения Максвелла являются классическим примером физического описания полей и их динамики.",
  "quantum_philosophy -> quantum_basics": "Философия квантовой механики опирается на базовые принципы квантовой физики и интерпретирует их концептуальный смысл.",
  "observer_role -> measurement_problem": "Проблема измерения в квантовой механике напрямую связана с философским анализом роли наблюдателя.",
  "determinism -> wave_function": "Волновая функция ставит под вопрос классический детерминизм и требует философского переосмысления причинности.",
  "relativity_philosophy -> special": "Специальная теория относительности имеет глубокие философские последствия, касающиеся времени и пространства.",
  "time_metaphysics -> general": "Общая теория относительности радикально меняет философские представления о времени и пространстве.",
  "reality_nature -> cosmology": "Космология рассматривает природу реальности в наиболее широком масштабе — Вселенной в целом.",
  "future_core -> philosophy_core": "Философия играет ключевую роль в осмыслении возможных направлений развития будущей физики.",
  "unknown_core -> philosophy_core": "Философия используется для анализа границ познания и областей фундаментального незнания.",
  "solar_cells -> future_core": "Связь существует на концептуальном уровне курса физики.",
  "determinism -> chaos_theory": "Теория хаоса показывает ограничения детерминизма в нелинейных динамических системах.",
  "quantum_algorithms -> mathematical_methods": "Квантовые алгоритмы опираются на развитые математические методы и абстрактные структуры.",
  "probability_interpretations -> copenhagen": "Копенгагенская интерпретация является одной из философских интерпретаций вероятностного характера квантовой механики.",
  "probability_interpretations -> statistical_physics": "Статистическая физика использует вероятностные интерпретации для описания макроскопических систем.",
  "least_action -> analytical_mech": "Принцип наименьшего действия лежит в основе аналитической механики.",
  "least_action -> feynman_path": "Интегралы по траекториям Фейнмана являются квантовым обобщением принципа наименьшего действия.",
  "ether_theories -> maxwell_eq": "Эфирные теории исторически рассматривались как интерпретация уравнений Максвелла.",
  "ether_theories -> special": "Специальная теория относительности возникла в результате отказа от эфирных теорий.",
  "philosophy_core -> copenhagen": "Копенгагенская интерпретация представляет собой философский подход к пониманию квантовой механики.",
  "philosophy_core -> ether_theories": "Эфирные теории являются примером философских и концептуальных предпосылок ранней физики.",
  "philosophy_core -> least_action": "Принцип наименьшего действия имеет глубокие философские интерпретации, связанные с оптимальностью и закономерностью природы.",
  "philosophy_core -> probability_interpretations": "Вероятностные интерпретации физических теорий требуют философского осмысления природы случайности.",
  "planck_formula -> quantum_basics": "Формула Планка положила начало квантовой физике, введя идею квантования энергии и тем самым заложив основы квантовых представлений.",
  "planck_formula -> photon_energy": "Формула Планка напрямую определяет энергию фотона как величину, пропорциональную частоте излучения.",
  "planck_formula -> quantum_optics": "Квантовая оптика основана на планковском описании излучения и квантовой природе света.",
  "quantum_basics -> wave_particle": "Основы квантовой физики включают принцип корпускулярно-волнового дуализма как фундаментальное свойство микромира.",
  "quantum_basics -> schrodinger": "Уравнение Шрёдингера является центральным математическим выражением базовых принципов квантовой механики.",
  "mkt -> ideal_gas": "Молекулярно-кинетическая теория объясняет модель идеального газа через движение и столкновения молекул.",
  "mkt -> maxwell": "Распределение Максвелла выводится в рамках молекулярно-кинетической теории и описывает статистику скоростей молекул.",
  "thermodynamics -> mkt": "Молекулярно-кинетическая теория связывает макроскопические законы термодинамики с микроскопическим движением частиц.",
  "thermodynamics -> entropy": "Понятие энтропии возникает в термодинамике как мера необратимости и направленности процессов.",
  "electromagnetism -> electrostatics": "Электростатика является частным случаем электромагнетизма для неподвижных электрических зарядов.",
  "electromagnetism -> current": "Электрический ток представляет собой динамическое проявление электрических зарядов в рамках электромагнетизма.",
  "electromagnetism -> magnetism": "Магнетизм рассматривается как следствие движения электрических зарядов в электромагнитной теории.",
  "magnetism -> lorentz_force": "Сила Лоренца описывает действие магнитного поля на движущийся заряд.",
  "current -> ohm_law": "Закон Ома устанавливает связь между током, напряжением и сопротивлением в электрических цепях.",
  "optics -> geo_optics": "Геометрическая оптика является приближением, описывающим распространение света в виде лучей.",
  "optics -> wave_optics": "Волновая оптика рассматривает свет как волну и объясняет интерференцию и дифракцию.",
  "light_laws -> wien_law": "Закон Вина описывает смещение максимума излучения абсолютно чёрного тела.",
  "light_laws -> rayleigh_jeans": "Формула Рэлея–Джинса является классическим приближением закона излучения.",
  "mechanics -> kinematics": "Кинематика является разделом механики, описывающим движение без учёта причин.",
  "mechanics -> dynamics": "Динамика изучает движение тел с учётом действующих сил.",
  "dynamics -> newton_laws": "Законы Ньютона составляют фундамент динамики классической механики.",
  "kinematics -> uniform_motion": "Равномерное движение является простейшим частным случаем кинематики.",
  "nuclear_physics -> nuclear_relations": "Ядерная физика включает изучение соотношений между характеристиками ядер.",
  "nuclear_relations -> moment_ratio_relation": "Соотношение магнитного момента и углового момента используется для описания свойств ядер.",
  "quantum_basics -> special": "Квантовые основы согласуются со специальной теорией относительности при описании микрочастиц.",
  "thermodynamics -> quantum_thermo": "Квантовая термодинамика обобщает классическую термодинамику на квантовые системы.",
  "maxwell -> light_characteristics": "Из уравнений Максвелла следует электромагнитная природа света и его основные характеристики.",
  "planck_formula -> photon_properties": "Формула Планка определяет ключевые свойства фотона как кванта электромагнитного поля.",
  "mkt -> h_theorem": "H-теорема Больцмана формализует рост энтропии в молекулярно-кинетической теории.",
  "mkt -> gas_laws": "Газовые законы выводятся как макроскопическое следствие молекулярного движения.",
  "gas_laws -> boyle_mariotte": "Закон Бойля–Мариотта описывает связь давления и объёма газа при постоянной температуре.",
  "gas_laws -> charles_law": "Закон Шарля устанавливает зависимость объёма газа от температуры.",
  "gas_laws -> dalton_law": "Закон Дальтона описывает давление смеси идеальных газов.",
  "mkt -> molecular_motion": "Молекулярно-кинетическая теория основана на представлении о хаотическом движении молекул.",
  "molecular_motion -> mean_free_path": "Средняя длина свободного пробега определяется характеристиками молекулярного движения.",
  "molecular_motion -> molecular_speeds": "Скорости молекул описываются статистическими распределениями.",
  "mkt -> state_equations": "Уравнения состояния связывают макроскопические параметры газа в рамках МКТ.",
  "state_equations -> clausius_clapeyron": "Уравнение Клапейрона–Клаузиуса описывает фазовые переходы.",
  "state_equations -> mendeleev_clapeyron": "Уравнение Менделеева–Клапейрона является частным случаем уравнений состояния.",
  "mkt -> humidity": "Влажность воздуха объясняется наличием водяного пара в газовой смеси.",
  "humidity -> absolute_humidity": "Абсолютная влажность количественно характеризует содержание водяного пара.",
  "thermodynamics -> heat_quantity": "Количество теплоты является ключевой величиной в термодинамике.",
  "electromagnetism -> electric_charge": "Электрический заряд является фундаментальной величиной электромагнетизма.",
  "electromagnetism -> electric_fields": "Электрическое поле описывает взаимодействие зарядов на расстоянии.",
  "electromagnetism -> circuit_laws": "Законы электрических цепей следуют из общих принципов электромагнетизма.",
  "electromagnetism -> current_interaction": "Взаимодействие токов объясняется магнитными эффектами.",
  "electromagnetism -> capacitance": "Ёмкость характеризует способность системы накапливать заряд.",
  "magnetism -> biot_savart": "Закон Био–Савара описывает магнитное поле, создаваемое током.",
  "magnetism -> faraday_law": "Закон Фарадея связывает изменение магнитного поля с возникновением ЭДС.",
  "current -> kirchhoff_laws": "Законы Кирхгофа формализуют сохранение заряда и энергии в электрических цепях.",
  "current -> resistance": "Сопротивление характеризует противодействие проводника электрическому току.",
  "electrostatics -> capacitors": "Конденсаторы являются устройствами для накопления электрического заряда.",
  "current -> emf": "Электродвижущая сила определяет источник тока в цепи.",
  "current -> power": "Мощность характеризует скорость передачи электрической энергии.",
  "electrostatics -> energy_density": "Плотность энергии описывает распределение энергии электрического поля.",
  "nuclear_physics -> nuclear_characteristics": "Ядерная физика изучает основные характеристики атомных ядер.",
  "transport -> diffusion_phenomena": "Явления переноса включают диффузию как один из фундаментальных механизмов переноса вещества и энергии.",
"nuclear_characteristics -> gyromagnetic_ratio": "Гиромагнитное отношение определяется как одна из ключевых характеристик ядерных систем.",
"nuclear_characteristics -> nuclear_magnetic_moment": "Магнитный момент ядра является фундаментальной ядерной характеристикой.",
"diffusion_phenomena -> diffusion_equation": "Уравнение диффузии математически описывает эволюцию диффузионных процессов во времени и пространстве.",
"nuclear_relations -> diffusion_applications": "Диффузионные модели применяются при описании процессов переноса в ядерных и плазменных системах.",
"gyromagnetic_ratio -> nuclear_magnetic_moment": "Гиромагнитное отношение связывает магнитный момент ядра с его угловым моментом.",
"magnetism -> nuclear_magnetic_moment": "Магнитный момент ядра проявляется при взаимодействии ядер с магнитным полем.",
"statistical_physics -> diffusion_equation": "Уравнение диффузии выводится в статистической физике как следствие случайного движения частиц.",
"maxwell -> diffusion_equation": "Диффузионное уравнение математически аналогично уравнениям Максвелла в приближённых режимах переноса.",

"optics -> light_characteristics": "Оптика изучает основные характеристики света как физического явления.",
"optics -> light_sources": "Источники света являются объектами изучения в оптике.",
"optics -> optical_params": "Оптические параметры используются для количественного описания оптических систем.",
"optics -> spatial_params": "Пространственные параметры описывают геометрию распространения света.",
"optics -> light_laws": "Законы света формируют основу геометрической и физической оптики.",
"optics -> light_relations": "Соотношения между световыми величинами выводятся в рамках оптики.",

"light_characteristics -> wavelength_visible": "Видимый диапазон длин волн является частным случаем спектральных характеристик света.",
"light_characteristics -> wave_number": "Волновое число определяется как пространственная характеристика световой волны.",
"light_characteristics -> light_intensity": "Интенсивность света является одной из основных энергетических характеристик излучения.",
"light_characteristics -> refractive_index": "Показатель преломления характеризует взаимодействие света со средой.",
"light_characteristics -> photometric_quantities": "Фотометрические величины вводятся на основе физических характеристик света.",

"light_sources -> luminous_intensity": "Сила света количественно описывает излучательную способность источника.",
"light_sources -> luminosity": "Светимость характеризует полную мощность светового излучения источника.",
"light_sources -> brightness": "Яркость описывает визуальное восприятие излучающей поверхности.",
"light_sources -> illuminance": "Освещённость характеризует освещение поверхности источниками света.",
"light_sources -> lens_characteristics": "Оптические характеристики линз определяют формирование изображения от источников света.",

"optical_params -> focal_length": "Фокусное расстояние является базовым параметром оптических систем.",
"optical_params -> optical_power": "Оптическая сила определяется как величина, обратная фокусному расстоянию.",
"optical_params -> angular_characteristics": "Угловые характеристики описывают направление и расходимость световых пучков.",

"spatial_params -> solid_angle": "Телесный угол является пространственной мерой распространения светового потока.",
"light_laws -> malus_law": "Закон Малюса описывает зависимость интенсивности поляризованного света от угла.",
"light_relations -> intensity_angle": "Интенсивность света зависит от углового распределения излучения.",
"light_relations -> illuminance_intensity": "Освещённость связана с силой света геометрическими соотношениями.",
"light_relations -> brightness_luminosity": "Яркость и светимость связаны через распределение светового потока.",

"photometry -> photometric_quantities": "Фотометрия систематизирует световые величины с учётом зрительного восприятия.",
"geo_optics -> lens_characteristics": "Геометрическая оптика описывает свойства линз в приближении световых лучей.",
"geo_optics -> optical_params": "Оптические параметры выводятся в геометрической оптике из законов преломления.",
"wave_optics -> light_characteristics": "Волновая оптика раскрывает волновые характеристики света.",

"oscillations -> wave_characteristics": "Волновые характеристики выводятся из общих свойств колебательных процессов.",
"harmonic -> pendulum_types": "Различные типы маятников реализуют гармонические колебания.",
"harmonic -> oscillation_params": "Параметры колебаний полностью описывают гармоническое движение.",

"electromagnetism -> em_oscillations": "Электромагнитные колебания являются следствием динамики электрических и магнитных полей.",
"mech_waves -> wave_speeds": "Скорость волны определяется свойствами среды и типом механической волны.",
"mech_waves -> wave_effects": "Механические волны проявляют интерференцию, отражение и преломление.",
"mech_waves -> wave_relations": "Соотношения между параметрами волн следуют из волновых уравнений.",

"classical_core -> mechanics": "Классическая физика включает механику как фундаментальный раздел, описывающий движение и взаимодействие тел.",
"classical_core -> thermodynamics": "Термодинамика является базовым разделом классической физики, изучающим тепловые процессы и энергообмен.",
"classical_core -> electromagnetism": "Электромагнетизм входит в классическую физику как теория электрических и магнитных полей.",
"classical_core -> optics": "Оптика является частью классической физики и описывает распространение и свойства света.",
"classical_core -> analytical_mech": "Аналитическая механика представляет формализованное развитие классической механики.",
"classical_core -> statistical_physics": "Статистическая физика расширяет классическую физику на системы с большим числом частиц.",
"classical_core -> nuclear_physics": "Ядерная физика исторически развивалась из классической физики и её экспериментальных методов.",
"classical_core -> condensed_matter": "Физика конденсированного состояния опирается на классические и статистические подходы.",

"mechanics -> conservation": "Законы сохранения составляют фундаментальный принцип механики.",
"mechanics -> oscillations": "Колебательные процессы являются частным случаем механического движения.",
"mechanics -> statics": "Статика изучает механические системы в состоянии покоя.",
"mechanics -> analytical_mech": "Аналитическая механика обобщает ньютоновскую механику с помощью вариационных принципов.",

"kinematics -> kinematics_motion": "Кинематика поступательного движения описывает движение без учёта причин.",
"kinematics -> kinematics_rotation": "Кинематика вращения изучает угловое движение тел.",
"kinematics -> kinematics_relativity": "Релятивистская кинематика расширяет классические представления о движении.",

"kinematics_motion -> uniform_motion": "Равномерное движение является простейшим видом поступательного движения.",
"kinematics_motion -> accel_motion": "Равноускоренное движение обобщает равномерное движение с учётом ускорения.",
"kinematics_motion -> free_fall": "Свободное падение является частным случаем равноускоренного движения.",

"forces -> friction_forces": "Силы трения являются одним из наиболее распространённых видов сил в механике.",
"equilibrium -> lever_principle": "Принцип рычага является следствием условий механического равновесия.",
"pressure -> liquid_pressure": "Давление в жидкости подчиняется гидростатическим законам.",

"maxwell_eq -> em_flux_density": "Плотность электромагнитного потока выводится из уравнений Максвелла.",
"dynamics -> forces": "Динамика изучает силы как причины изменения движения.",
"dynamics -> complex_forces": "Сложные силы возникают при взаимодействии нескольких физических факторов.",

"conservation -> energy": "Закон сохранения энергии является универсальным принципом физики.",
"conservation -> momentum": "Импульс сохраняется в замкнутых механических системах.",
"conservation -> angular_momentum": "Момент импульса сохраняется при отсутствии внешних моментов.",

"oscillations -> harmonic": "Гармонические колебания являются базовой моделью колебательных процессов.",
"oscillations -> damped": "Затухающие колебания учитывают потери энергии в системе.",
"oscillations -> mech_waves": "Механические волны возникают как распространение колебаний в среде.",

"statics -> equilibrium": "Равновесие является центральным понятием статики.",
"statics -> pressure": "Давление рассматривается в статике как распределённая сила.",
"statics -> archimedes": "Закон Архимеда следует из условий равновесия в жидкости.",

"thermodynamics -> thermo_laws": "Законы термодинамики формируют фундамент всей термодинамической теории.",
"thermodynamics -> heat_machines": "Тепловые машины являются прикладным результатом термодинамики.",
"mkt -> transport": "Кинетическая теория объясняет процессы переноса на микроскопическом уровне.",

"electromagnetism -> maxwell_eq": "Уравнения Максвелла составляют фундамент электромагнетизма.",
"optics -> photometry": "Фотометрия является прикладным разделом оптики.",
"analytical_mech -> lagrange": "Лагранжева формализация является центральным методом аналитической механики.",
"analytical_mech -> hamilton": "Гамильтонова формализация обобщает лагранжев подход.",
"analytical_mech -> celestial": "Небесная механика является классическим приложением аналитической механики.",

"phase_transitions -> thermodynamics": "Фазовые переходы описываются в рамках термодинамики.",
"phase_transitions -> mkt": "Микроскопическая природа фазовых переходов объясняется кинетической теорией.",
"phase_transitions -> statistical_physics": "Статистическая физика описывает фазовые переходы на уровне ансамблей.",

"statistical_physics -> thermodynamics": "Термодинамика выводится как макроскопический предел статистической физики.",
"nuclear_physics -> thermodynamics": "Ядерные процессы подчиняются законам сохранения энергии и термодинамики.",
"condensed_matter -> statistical_physics": "Физика конденсированного состояния опирается на статистические методы.",

"quantum_core -> quantum_basics": "Основы квантовой физики формируют фундамент квантового раздела физики.",
"quantum_core -> atomic_physics": "Атомная физика является прямым применением квантовых принципов.",
"quantum_core -> quantum_effects": "Квантовые эффекты демонстрируют отличие микромира от классической физики.",
"quantum_core -> qft": "Квантовая теория поля обобщает квантовую механику на релятивистские поля.",
"quantum_core -> quantum_apps": "Квантовые технологии основаны на фундаментальных квантовых принципах.",
"quantum_core -> particle_physics": "Физика элементарных частиц является центральным направлением квантовой теории.",

"quantum_basics -> uncertainty": "Соотношения неопределённостей являются фундаментальным принципом квантовой механики.",
"quantum_basics -> wave_function": "Волновая функция является основным объектом квантового описания.",
"quantum_basics -> hilbert_space": "Гильбертово пространство задаёт математическую структуру квантовой теории.",

 "atomic_physics -> bohr_model": "Модель Бора является исторически первой квантовой моделью атома, объясняющей дискретность энергетических уровней.",
"atomic_physics -> quantum_numbers": "Квантовые числа вводятся для классификации допустимых состояний электрона в атоме.",
"atomic_physics -> electron_spin": "Спин электрона является фундаментальным квантовым свойством, необходимым для полного описания атомных состояний.",
"atomic_physics -> pauli": "Принцип запрета Паули объясняет электронную структуру атомов и устойчивость вещества.",

"quantum_effects -> tunneling": "Квантовое туннелирование демонстрирует невозможность классического описания микрочастиц.",
"quantum_effects -> entanglement": "Квантовая запутанность отражает нелокальный характер квантовых корреляций.",
"quantum_effects -> superposition": "Принцип суперпозиции лежит в основе всех квантовых состояний.",
"quantum_effects -> aharonov_bohm": "Эффект Ахаронова–Бома показывает физическую значимость потенциалов в квантовой механике.",

"qft -> qed": "Квантовая электродинамика является частным случаем квантовой теории поля для электромагнитного взаимодействия.",
"qft -> qcd": "Квантовая хромодинамика описывает сильное взаимодействие в рамках квантовой теории поля.",
"qft -> standard_model": "Стандартная модель формулируется на языке квантовой теории поля.",
"qft -> higgs": "Механизм Хиггса реализуется в рамках квантовой теории поля и калибровочных симметрий.",

"quantum_apps -> quantum_computing": "Квантовые вычисления используют суперпозицию и запутанность для обработки информации.",
"quantum_apps -> quantum_crypto": "Квантовая криптография основана на фундаментальных ограничениях квантовых измерений.",
"quantum_apps -> quantum_sensors": "Квантовые сенсоры используют квантовую когерентность для повышения точности измерений.",
"quantum_apps -> quantum_thermo": "Квантовая термодинамика расширяет классические понятия энергии и энтропии.",
"quantum_apps -> quantum_optics": "Квантовая оптика изучает взаимодействие света и вещества на квантовом уровне.",

"relativity_core -> special": "Специальная теория относительности является фундаментом релятивистской физики.",
"relativity_core -> general": "Общая теория относительности обобщает специальную теорию на неинерциальные системы.",
"relativity_core -> cosmology": "Космология основана на релятивистском описании пространства-времени.",

"special -> postulates": "Постулаты СТО формируют логическую основу релятивистской кинематики.",
"special -> lorenz": "Преобразования Лоренца описывают связь между инерциальными системами отсчёта.",
"special -> effects": "Релятивистские эффекты следуют непосредственно из преобразований Лоренца.",
"special -> energy_momentum": "Связь энергии и импульса является следствием релятивистской динамики.",

"effects -> dilation": "Замедление времени является прямым следствием релятивистских эффектов.",
"effects -> length_contraction": "Лоренцево сокращение длины возникает при относительном движении.",

"general -> equivalence": "Принцип эквивалентности лежит в основе общей теории относительности.",
"general -> einstein_eq": "Уравнения Эйнштейна формализуют связь геометрии пространства-времени и материи.",
"general -> black_holes": "Чёрные дыры являются точными решениями уравнений Эйнштейна.",
"general -> grav_waves": "Гравитационные волны предсказываются динамикой искривлённого пространства-времени.",

"cosmology -> dark_matter": "Тёмная материя вводится для объяснения гравитационных эффектов в космологии.",
"cosmology -> dark_energy": "Тёмная энергия объясняет ускоренное расширение Вселенной.",
"cosmology -> universe_evolution": "Эволюция Вселенной описывается космологическими моделями.",

"future_core -> quantum_gravity": "Квантовая гравитация направлена на объединение квантовой теории и ОТО.",
"future_core -> beyond_standard": "Физика за пределами стандартной модели решает её фундаментальные ограничения.",
"future_core -> quantum_tech": "Квантовые технологии представляют прикладное развитие квантовой физики.",
"future_core -> fusion": "Термоядерный синтез рассматривается как перспективный источник энергии.",
"future_core -> accelerators": "Развитие ускорителей расширяет экспериментальные границы физики частиц.",
"future_core -> medical_physics": "Медицинская физика применяет физические принципы в диагностике и терапии.",
"future_core -> neurophysics": "Нейрофизика изучает физические процессы в нейронных системах.",
"future_core -> multiverse": "Гипотеза мультивселенной возникает в современных космологических теориях.",
"future_core -> ai_physics": "Искусственный интеллект используется для анализа и моделирования физических систем.",
"future_core -> tech_control": "Контроль технологий требует физической оценки рисков и последствий.",
"future_core -> scientific_status": "Будущее физики связано с философскими вопросами статуса научных теорий.",
"future_core -> neutron_stars": "Нейтронные звёзды являются лабораторией экстремальной физики.",
"future_core -> superconductivity": "Сверхпроводимость является ключевым направлением физики конденсированного состояния.",
"future_core -> semiconductors": "Полупроводники лежат в основе современной электроники.",
"future_core -> particle_accelerators": "Ускорители частиц являются инструментами исследования фундаментальных взаимодействий.",
"future_core -> chaos_theory": "Теория хаоса описывает пределы предсказуемости физических систем.",

"quantum_gravity -> string_theory": "Теория струн является одним из подходов к квантовой гравитации.",
"quantum_gravity -> loop_gravity": "Петлевая квантовая гравитация предлагает дискретную структуру пространства-времени.",

"beyond_standard -> neutrino": "Массы нейтрино указывают на физику за пределами стандартной модели.",

"quantum_tech -> quantum_information": "Квантовая информация формирует теоретическую основу квантовых технологий.",
"quantum_tech -> quantum_simulators": "Квантовые симуляторы используются для моделирования сложных квантовых систем.",

"unknown_core -> measurement_problem": "Проблема измерения отражает концептуальные трудности квантовой механики.",
"unknown_core -> time_nature": "Природа времени остаётся открытым вопросом фундаментальной физики.",
"unknown_core -> consciousness": "Связь сознания и физики является предметом философских дискуссий.",
"unknown_core -> hierarchy": "Проблема иерархий касается масштабов фундаментальных констант.",
"unknown_core -> anthropic": "Антропный подход используется для интерпретации космологических параметров.",
"unknown_core -> time_arrow": "Стрела времени связывает физику с термодинамической необратимостью.",
"unknown_core -> wave_collapse": "Коллапс волновой функции остаётся интерпретационной проблемой.",
"unknown_core -> spacetime_discrete": "Дискретность пространства-времени предполагается в теориях квантовой гравитации.",
"unknown_core -> local_realism": "Нарушение локального реализма подтверждается квантовыми экспериментами.",
"unknown_core -> crisis_cosmology": "Современная космология сталкивается с расхождениями наблюдательных данных.",

"mechanics -> quantum_basics": "Квантовая механика обобщает классическую механику на микромасштабы.",
"electromagnetism -> qed": "КЭД является квантовым обобщением классического электромагнетизма.",
"optics -> quantum_optics": "Квантовая оптика расширяет классическую оптику на уровень фотонов.",
"mechanics -> special": "Релятивистская механика обобщает ньютоновскую механику.",
"electromagnetism -> general": "Электромагнитные поля учитываются в общей теории относительности.",
"celestial -> cosmology": "Небесная механика переходит в космологию при больших масштабах.",
"quantum_effects -> general": "Квантовые эффекты рассматриваются в контексте гравитации и пространства-времени.",
"qft -> cosmology": "Квантовые поля играют ключевую роль в ранней Вселенной.",

"future_core -> classical_core": "Будущее физики опирается на переосмысление классических теорий.",
"future_core -> quantum_core": "Квантовая физика остаётся центральным направлением будущих исследований.",
"future_core -> relativity_core": "Релятивистская физика необходима для описания космических масштабов.",
"future_core -> unknown_core": "Будущие исследования направлены на устранение фундаментальных пробелов.",
"future_core -> mass_defect": "Дефект массы является ключом к пониманию происхождения энергии связи.",

 "future_core -> decay_law": "Закон радиоактивного распада является базовым инструментом для описания нестабильных систем и процессов в ядерной и астрофизике.",

"unknown_core -> classical_core": "Фундаментальные пробелы знания формулируются на фоне предельных возможностей классических теорий.",
"unknown_core -> quantum_core": "Открытые вопросы напрямую связаны с интерпретацией и пределами применимости квантовой теории.",
"unknown_core -> relativity_core": "Неизвестное в современной физике во многом связано с гравитацией и структурой пространства-времени.",

"thermodynamics -> quantum_information": "Квантовая информация использует энтропийные и статистические понятия, обобщая термодинамику на квантовые состояния.",
"entropy -> entanglement": "Запутанность формально связана с энтропийными мерами (энтропия фон Неймана) и распределением информации между подсистемами.",
"thermo_laws -> measurement_problem": "Проблема измерения затрагивает необратимость, рост энтропии и переход от квантового описания к классическим результатам.",

"schrodinger -> dirac_equation": "Уравнение Дирака является релятивистским обобщением уравнения Шрёдингера для частиц со спином 1/2.",
"dirac_equation -> special": "Уравнение Дирака построено так, чтобы быть совместимым с принципами специальной теории относительности.",
"qft -> lorenz": "Квантовая теория поля требует лоренц-инвариантности как базового принципа построения физических законов.",

"quantum_effects -> photosynthesis": "Квантовые эффекты рассматриваются как возможный механизм эффективного переноса энергии в фотосинтетических комплексах.",
"photosynthesis -> energy": "Фотосинтез является процессом преобразования энергии фотонов в химическую энергию связей.",

"neurophysics -> quantum_sensors": "Квантовые сенсоры используются как высокочувствительные инструменты измерения слабых магнитных и электрических сигналов в биосистемах.",
"black_holes -> quantum_gravity": "Чёрные дыры являются ключевым тестовым полигоном для теорий квантовой гравитации из-за сочетания сильной гравитации и квантовых эффектов.",
"cosmic_rays -> standard_model": "Сверхвысокоэнергетические космические лучи проверяют предсказания стандартной модели во взаимодействиях при экстремальных энергиях.",

"chaos_theory -> quantum_chaos": "Квантовый хаос исследует квантовые аналоги классической хаотической динамики через спектральные и статистические признаки.",
"hydrodynamics -> navier_stokes": "Уравнения Навье–Стокса являются математической основой классической гидродинамики.",
"navier_stokes -> quantum_fluids": "Квантовые жидкости описываются гидродинамическими уравнениями с квантовыми поправками и коллективными переменными.",

"quantum_algorithms -> quantum_information": "Квантовые алгоритмы формализуются в рамках теории квантовой информации и операций над состояниями.",
"topological_insulators -> condensed_matter": "Топологические изоляторы — раздел физики конденсированного состояния, описывающий фазовые состояния с топологической защитой.",
"topological_insulators -> general": "В релятивистском эффективном описании топологические состояния связываются с геометрическими и калибровочными структурами (эффективные поля, кривизна).",

"holographic_principle -> string_theory": "Голографический принцип реализуется в теории струн через дуальность AdS/CFT и соответствия гравитации и полевой теории.",
"holographic_principle -> black_holes": "Голографический принцип мотивирован термодинамикой чёрных дыр и масштабированием энтропии по площади горизонта.",
"holographic_principle -> quantum_information": "Голография связывает геометрию с распределением квантовой информации и энтропией запутанности.",

"quantum_biology -> photosynthesis": "Фотосинтез рассматривается как ключевой пример возможной роли квантовых механизмов в биологических системах.",
"quantum_biology -> quantum_coherence": "Квантовая когерентность является центральным предполагаемым ресурсом в моделях квантовой биологии.",

"magnetic_sense -> electron_spin": "Магниточувствительность в радикально-парном механизме опирается на спиновые степени свободы электронов.",
"quantum_mind -> consciousness": "Квантовый разум — гипотетический подход к объяснению сознания через физические процессы (без общепринятого статуса).",
"quantum_mind -> superposition": "В квантово-ментальных гипотезах суперпозиция рассматривается как возможный носитель альтернативных когнитивных состояний.",

"archaeophysics -> nuclear_physics": "Археофизика использует методы ядерной физики (радиоизотопные часы, взаимодействие излучения с веществом) для датировки и анализа.",
"mri_technology -> electron_spin": "МРТ основана на магнитных моментах и спиновой динамике (в первую очередь ядерных спинов), что концептуально связано со спином как квантовым свойством.",
"mri_technology -> medical_physics": "МРТ является прикладной областью медицинской физики, объединяющей измерения, безопасность и интерпретацию сигналов.",

"solar_cells -> thermodynamics": "Эффективность солнечных элементов ограничена термодинамическими принципами преобразования энергии и неравновесными процессами.",
"gps_systems -> special": "GPS требует поправок специальной теории относительности из-за движения спутников и релятивистского хода часов.",
"gps_systems -> celestial": "Орбитальная динамика спутников и расчёт траекторий относятся к небесной механике.",

"quantum_physics -> quantum_fluids": "Квантовые жидкости представляют коллективные квантовые состояния материи и входят в область квантовой физики.",
"quantum_physics -> topological_insulators": "Топологические изоляторы являются квантовыми фазами вещества и относятся к квантовой физике конденсированного состояния.",

"quantum_fluids -> quantum_core": "Квантовые жидкости опираются на базовые понятия квантовой теории и коллективных возбуждений.",
"topological_insulators -> quantum_core": "Топологические фазы требуют квантового описания зонной структуры и инвариантов.",
"quantum_fluids -> topological_insulators": "Обе области объединяются понятием квантовых фаз, топологических инвариантов и коллективных мод.",

"proton_mass_future -> future_core": "Происхождение массы протона и роль динамики QCD рассматриваются как активная область будущих исследований.",
"classical_core -> fundamental_constants": "Классическая физика опирается на фундаментальные константы как на параметры масштабов и предельных законов.",
"classical_core -> phase_transitions": "Фазовые переходы традиционно формулируются в классической термодинамике и статистике.",

"dynamics -> friction_forces": "Силы трения являются ключевым примером неидеальных сил в динамике и вводят диссипацию.",
"dynamics -> lever_principle": "Рычаг и моменты сил используются в динамике для описания вращательного равновесия и движения.",

"electromagnetism -> em_flux_density": "Плотность потока (электрического/магнитного) является базовой величиной электромагнетизма и входит в уравнения Максвелла.",
"em_oscillations -> em_period": "Период электромагнитных колебаний определяется параметрами колебательного контура и частотой.",
"em_oscillations -> resonance_frequency": "Резонансная частота является определяющей характеристикой электромагнитных колебательных систем.",

"fundamental_constants -> avogadro_number": "Число Авогадро задаёт связь между микроскопическим числом частиц и макроскопической величиной моля.",
"fundamental_constants -> bohr_radius": "Боровский радиус выражается через фундаментальные константы и задаёт атомный масштаб длины.",
"fundamental_constants -> electron_mass": "Масса электрона является фундаментальной константой микрофизики.",
"fundamental_constants -> elementary_charge": "Элементарный заряд задаёт квант электрического заряда и масштаб электромагнитных взаимодействий.",
"fundamental_constants -> fine_structure": "Постоянная тонкой структуры выражается через e, ħ и c и задаёт силу электромагнитного взаимодействия.",
"fundamental_constants -> free_fall_accel": "Ускорение свободного падения задаёт характерный масштаб гравитации вблизи Земли.",
"fundamental_constants -> g_constant": "Гравитационная постоянная определяет масштаб ньютоновского тяготения.",
"fundamental_constants -> gas_constant": "Газовая постоянная связывает макроскопическое описание идеального газа с микроскопическими параметрами.",
"fundamental_constants -> neutron_mass": "Масса нейтрона является фундаментальной величиной ядерной физики.",
"fundamental_constants -> planck_constant": "Постоянная Планка задаёт квантовый масштаб действия и квантования.",
"fundamental_constants -> proton_mass": "Масса протона задаёт характерный масштаб барионной материи.",
"fundamental_constants -> speed_of_light": "Скорость света является универсальным инвариантом и предельной скоростью переноса взаимодействий.",

"kinematics -> accel_motion": "Ускоренное движение является базовым типом движения в кинематике.",
"kinematics -> free_fall": "Свободное падение является частным случаем равноускоренного движения под действием гравитации.",
"mechanics -> hydrodynamics": "Гидродинамика рассматривается как раздел механики сплошных сред.",

"oscillation_params -> angular_frequency": "Угловая частота является основным параметром гармонических колебаний.",
"oscillation_params -> frequency": "Частота задаёт число колебаний в единицу времени и является ключевой характеристикой процесса.",
"oscillation_params -> oscillation_period": "Период связан с частотой как T=1/ν и используется для временного описания колебаний.",

"pendulum_types -> math_pendulum": "Математический маятник задаёт идеализированную модель колебаний точечной массы.",
"pendulum_types -> phys_pendulum": "Физический маятник учитывает распределение массы и момент инерции.",
"pendulum_types -> spring_pendulum": "Пружинный маятник описывает колебания в потенциальном поле упругости.",
"pendulum_types -> torsion_pendulum": "Крутильный маятник моделирует колебания за счёт упругости при кручении.",

"statics -> liquid_pressure": "Давление жидкости является базовой темой гидростатики.",
"wave_characteristics -> amplitude": "Амплитуда задаёт максимальное отклонение и энергию волны.",
"wave_characteristics -> phase_velocity": "Фазовая скорость описывает перенос фазы волны в среде.",
"wave_characteristics -> surface_tension": "Поверхностное натяжение определяет свойства поверхностных волн в жидкостях.",
"wave_characteristics -> wavelength": "Длина волны является фундаментальной характеристикой периодических процессов.",

"wave_effects -> doppler_effect": "Эффект Доплера описывает изменение наблюдаемой частоты при относительном движении источника и наблюдателя.",
"wave_effects -> pause_law": "Закон Пауза связывает акустические параметры излучения с характеристиками восприятия (психоакустика/акустика).",

"wave_relations -> medium_properties": "Свойства среды определяют скорость и затухание волн.",
"wave_relations -> period_frequency": "Период и частота связаны обратной зависимостью и определяют временной масштаб волны.",
"wave_relations -> wave_speed_relation": "Связь v=λν объединяет скорость, длину волны и частоту.",

"wave_speeds -> electricity_speed": "Скорость распространения электрического сигнала зависит от параметров линии и среды.",
"wave_speeds -> em_wave_speed": "Скорость электромагнитных волн определяется параметрами среды и в вакууме равна c.",
"wave_speeds -> phase_wave_speed": "Фазовая скорость является частным типом скорости волн и зависит от дисперсии.",
"wave_speeds -> sound_speed_gas": "Скорость звука в газе определяется термодинамическими параметрами и составом.",

"atomic_structure -> bohr_radius": "Атомная структура использует боровский радиус как характерный масштаб длины в атомах.",
"atomic_structure -> quantum_moments": "Орбитальные и спиновые моменты определяют магнитные и спектральные свойства атомных состояний.",

"photon_properties -> compton_wavelength": "Комптоновская длина волны задаёт квантовый масштаб для взаимодействий фотонов с частицами массы m.",
"photon_properties -> photon_energy": "Энергия фотона определяется его частотой и лежит в основе квантового описания излучения.",

"quantum_basics -> atomic_structure": "Квантовые основы необходимы для описания электронных оболочек и уровней энергии.",
"quantum_basics -> dirac_equation": "Релятивистская квантовая динамика приводит к уравнению Дирака как фундаментальному объекту.",
"quantum_basics -> feynman_path": "Интеграл по траекториям является альтернативной формулировкой квантовой механики.",
"quantum_basics -> photon_properties": "Квантовые основы объясняют свет как поток квантов с дискретными характеристиками.",

"quantum_computing -> quantum_algorithms": "Квантовые алгоритмы являются содержательным ядром квантовых вычислений.",
"quantum_effects -> quantum_chaos": "Квантовый хаос рассматривается как проявление квантовых эффектов в динамических системах.",
"quantum_effects -> quantum_coherence": "Когерентность является ключевым квантовым ресурсом, определяющим наблюдаемые квантовые эффекты.",

"quantum_moments -> orbital_moment": "Орбитальный момент является вкладом углового момента, связанным с движением частицы.",
"quantum_moments -> spin_moment": "Спиновый момент — внутренний вклад в полный момент количества движения.",

"future_core -> quantum_biology": "Квантовая биология рассматривается как перспективное направление на стыке квантовой физики и биосистем.",
"quantum_biology -> magnetic_sense": "Магниточувствительность биосистем рассматривается как один из возможных эффектов квантовой биологии.",

"tech_control -> solar_cells": "Технологический контроль включает оценку и управление энергетическими технологиями, включая солнечную энергетику.",
"quantum_thermo -> proton_mass_future": "Квантово-статистические методы и энергетические соотношения используются для обсуждения происхождения массы и энергии связи в QCD.",
"cosmology -> cosmic_rays": "Космические лучи являются наблюдательным каналом космологии и высокоэнергетической астрофизики.",
"effects -> gps_systems": "GPS является практическим применением релятивистских эффектов, требующим поправок к ходу времени."

}
