{
  "ontology": "Раздел философии, исследующий наиболее общие формы и категории бытия: что существует, в каком смысле существует и какие типы сущего допускаются в рамках различных теорий. В философии науки онтология анализирует онтологические обязательства физических моделей — какие объекты, структуры и сущности предполагаются реальными, а какие носят инструментальный или условный характер.",
  "epistemology": "Философская дисциплина, изучающая природу знания, его источники, формы и пределы. В контексте науки эпистемология анализирует способы получения достоверного знания, роль эксперимента и теории, критерии истинности, подтверждения и объяснения.",
  "metaphysics": "Философская область, направленная на исследование предельных оснований реальности: структуры мира, причинности, возможности и необходимости. В философии физики метафизика служит рамкой для осмысления того, что именно описывают фундаментальные теории и каков статус их понятий.",
  "objective_reality": "Понятие существования физического мира независимо от субъекта, его восприятия и актов познания. Используется для анализа научного реализма, объективности измерений и статуса физических величин в различных интерпретациях теорий.",
  "dark_matter_ontology": "Философский анализ статуса тёмной материи как гипотетической, но теоретически необходимой сущности современной космологии. Рассматриваются критерии её онтологического принятия, роль в объяснении наблюдательных данных и границы между эмпирическим и теоретическим существованием.",
  "observer_role": "Проблема статуса наблюдателя в физической теории, включая влияние измерения на систему и границы объективного описания. Особенно значима в квантовой механике, где акт наблюдения включён в формализм теории.",
  "scientific_method": "Совокупность принципов и процедур построения научного знания: формулирование гипотез, построение моделей, экспериментальная проверка, воспроизводимость результатов и логическая согласованность теории.",
  "time_metaphysics": "Раздел метафизики, исследующий онтологический статус времени: является ли оно фундаментальной сущностью, отношением между событиями или производной физического описания. Анализируется в связи с классической, релятивистской и квантовой физикой.",
  "anthropic_principle": "Методологический принцип, утверждающий, что наблюдаемые свойства Вселенной ограничены условиями существования наблюдателей. Используется в космологии для обсуждения значений фундаментальных констант и структуры Вселенной.",
  "quantum_philosophy": "Философский анализ оснований квантовой механики, включая интерпретацию волновой функции, вероятностный характер предсказаний, проблему измерения и статус квантовой реальности.",
  "relativity_philosophy": "Философское осмысление последствий теории относительности для понятий пространства, времени, причинности и объективности. Анализируется отказ от абсолютных структур и переход к реляционному описанию мира.",
  "consciousness_philosophy": "Философский анализ природы сознания и его возможной связи с физическими процессами. Рассматриваются проблемы редукции ментальных состояний, субъективного опыта и границ физического объяснения.",
  "determinism": "Философский тезис о том, что состояние системы в каждый момент времени однозначно определяется законами природы и предыдущими состояниями. Различают онтологический детерминизм и ограничения предсказуемости на уровне знания.",
  "field_nature": "Проблема онтологического статуса физического поля: является ли оно фундаментальной сущностью или удобным способом описания взаимодействий между частицами. Центральна для классической и квантовой теории поля.",
  "reality_nature": "Философская проблема соотношения физической реальности и её теоретических описаний. Включает дебаты между научным реализмом, конструктивизмом и инструментализмом.",
  "mathematical_methods": "Философский анализ роли математики в физике: использование абстрактных структур, моделей, симметрий и идеализаций для описания и предсказания физических явлений.",
  "least_action": "Универсальный вариационный принцип, согласно которому физические процессы реализуются так, что функционал действия принимает стационарное значение. Служит общей методологической основой классической и современной физики.",
  "ether_theories": "Исторические физические теории, вводившие эфир как материальную среду для распространения света. Рассматриваются в философии науки как пример смены фундаментальных понятий и онтологических обязательств.",
  "probability_interpretations": "Различные философские трактовки вероятности — частотная, субъективная, объективная и причинная — применяемые к статистическим и квантовым теориям.",
  "copenhagen": "Копенгагенская интерпретация квантовой механики, подчёркивающая роль измерения, принцип комплементарности и отказ от классической наглядности микромира.",
  "mechanics": "Фундаментальный раздел физики, изучающий движение, равновесие и взаимодействие материальных тел на основе законов Ньютона и принципов сохранения.",
  "kinematics": "Раздел механики, описывающий движение тел без анализа причин, через геометрические и временные характеристики.",
  "kinematics_motion": "Идеализированное описание движения материальной точки как базовой модели для анализа траекторий, скоростей и ускорений.",
  "kinematics_rotation": "Описание вращательного движения твёрдых тел с использованием угловых величин и кинематических связей.",
  "kinematics_relativity": "Принцип относительности движения, согласно которому характеристики движения зависят от выбора системы отсчёта.",
  "uniform_motion": "Простейший вид движения с постоянной скоростью и нулевым ускорением.",
  "accel_motion": "Движение, при котором скорость изменяется со временем под действием постоянного ускорения.",
  "free_fall": "Движение тела под действием силы тяжести при отсутствии сопротивления среды.",
  "dynamics": "Раздел механики, изучающий причины движения и взаимодействия тел через силы и законы движения.",
  "newton_laws": "Три фундаментальных закона механики, устанавливающих связь между силой, массой, ускорением и инерциальными системами отсчёта.",
  "forces": "Физические взаимодействия, описываемые в форме сил, вызывающих изменение движения или формы тел.",
  "complex_forces": "Движение тел под действием нескольких сил, анализируемое с использованием принципа суперпозиции.",
  "friction_forces": "Силы сопротивления, возникающие при контакте поверхностей и приводящие к рассеянию механической энергии.",
  "lever_principle": "Принцип статического равновесия рычага, выражающий равенство моментов сил относительно точки опоры.",
  "conservation": "Фундаментальные законы сохранения, утверждающие неизменность энергии, импульса и момента импульса в замкнутых системах.",
  "energy": "Универсальная скалярная величина, характеризующая способность системы совершать работу и переходить между различными формами движения.",
  "momentum": "Векторная величина, характеризующая количество движения и сохраняющаяся при отсутствии внешних воздействий.",
  "angular_momentum": "Векторная характеристика вращательного движения, связанная с симметриями пространства и законами сохранения.",
  "oscillations": "Периодические процессы в физических системах, характеризуемые повторяемостью состояний во времени.",
  "harmonic": "Простейший тип колебаний, при котором восстанавливающая сила пропорциональна отклонению от равновесия.",
  "damped": "Колебательные процессы, в которых амплитуда со временем уменьшается из-за потерь энергии.",
  "mech_waves": "Процессы распространения механических возмущений в упругих средах с переносом энергии и импульса без переноса вещества.",
  "statics": "Раздел классической механики, изучающий условия равновесия материальных тел и систем сил. Статика анализирует распределение сил и моментов в неподвижных или квазистационарных системах и служит фундаментом для инженерных расчётов и теории конструкций.",
  "equilibrium": "Состояние механической системы, при котором векторная сумма всех действующих сил и моментов равна нулю. В таком состоянии тело либо покоится, либо движется равномерно и прямолинейно, что отражает баланс взаимодействий.",
  "pressure": "Скалярная физическая величина, характеризующая интенсивность силового воздействия на поверхность. Определяется как сила, действующая перпендикулярно поверхности, отнесённая к площади, и играет ключевую роль в механике сплошных сред.",
  "archimedes": "Фундаментальный закон гидростатики, согласно которому на тело, погружённое в жидкость или газ, действует выталкивающая сила, равная весу вытесненной среды. Закон объясняет плавание тел и лежит в основе гидростатических расчётов.",
  "liquid_pressure": "Гидростатическое давление, создаваемое столбом жидкости, зависящее от плотности среды, ускорения свободного падения и глубины. Это давление возрастает линейно с глубиной и не зависит от формы сосуда.",
  "thermodynamics": "Фундаментальный раздел физики, изучающий тепловые процессы, превращения энергии и работу в макроскопических системах. Термодинамика опирается на общие законы, не зависящие от микроскопической структуры вещества.",
  "thermo_laws": "Совокупность фундаментальных принципов, определяющих возможные и невозможные термодинамические процессы. Эти законы задают направление тепловых процессов, ограничения на преобразование энергии и условия равновесия.",
  "entropy": "Физическая величина, характеризующая степень неупорядоченности системы и число доступных микросостояний. Энтропия играет ключевую роль в описании необратимости процессов и направления времени в физике.",
  "heat_machines": "Технические и физические системы, осуществляющие преобразование тепловой энергии в механическую работу или перенос тепла между телами. Их анализ стал исторической основой формирования термодинамики.",
  "mkt": "Молекулярно-кинетическая теория, связывающая макроскопические свойства вещества с хаотическим движением и столкновениями его микроскопических частиц. Она обеспечивает микроскопическое обоснование термодинамических законов.",
  "ideal_gas": "Упрощённая модель газа, в которой молекулы считаются материальными точками без взаимодействий, кроме упругих столкновений. Эта модель позволяет аналитически описывать основные газовые законы.",
  "maxwell": "Статистическое распределение скоростей молекул в идеальном газе при тепловом равновесии. Оно стало одним из первых примеров применения вероятностных методов в физике.",
  "transport": "Класс физических явлений, связанных с переносом массы, импульса и энергии в средах. Эти процессы возникают из-за микроскопического движения частиц и играют ключевую роль в термодинамике и гидродинамике.",
  "electromagnetism": "Фундаментальный раздел физики, объединяющий электрические и магнитные явления в рамках единой теории поля. Электромагнетизм оказал решающее влияние на развитие современной физики и технологий.",
  "electrostatics": "Раздел электромагнетизма, изучающий электрические заряды и поля в состоянии покоя. Электростатика является исторически первым этапом развития теории электричества.",
  "current": "Упорядоченное движение электрических зарядов в проводниках, полупроводниках и плазме. Электрический ток лежит в основе работы электрических цепей и электронных устройств.",
  "magnetism": "Совокупность явлений, связанных с магнитными полями, токами и магнитными моментами частиц. Магнетизм был объединён с электричеством в единую электромагнитную теорию.",
  "maxwell_eq": "Система фундаментальных уравнений, описывающих поведение электромагнитного поля и его связь с источниками — электрическими зарядами и токами. Эти уравнения предсказали существование электромагнитных волн.",
  "em_flux_density": "Физическая величина, характеризующая поток электромагнитной энергии через поверхность. Связана с направлением и интенсивностью переноса энергии электромагнитным полем.",
  "optics": "Раздел физики, изучающий природу света, его распространение, взаимодействие с веществом и формирование изображений. Оптика соединяет геометрические, волновые и квантовые представления.",
  "geo_optics": "Приближение оптики, в котором свет рассматривается как совокупность лучей. Используется для анализа отражения, преломления и работы оптических приборов.",
  "wave_optics": "Раздел оптики, учитывающий волновую природу света. Объясняет интерференцию, дифракцию и поляризацию, недоступные в геометрическом приближении.",
  "photometry": "Раздел оптики, посвящённый количественному измерению световых величин с учётом физиологических особенностей зрительного восприятия человека.",
  "condensed_matter": "Раздел физики, изучающий коллективные свойства твёрдых тел, жидкостей и сложных материалов. Он описывает фазовые переходы, электронные свойства и новые состояния вещества.",
  "statistical_physics": "Физическая теория, связывающая микроскопические законы движения частиц с макроскопическими термодинамическими величинами с помощью статистических методов.",
  "analytical_mech": "Обобщённая формулировка классической механики, использующая вариационные принципы и абстрактные координаты. Позволяет описывать сложные системы с ограничениями.",
  "lagrange": "Лагранжев формализм механики, в котором динамика системы описывается через функцию Лагранжа и обобщённые координаты. Удобен для систем со связями и симметриями.",
  "hamilton": "Гамильтонов формализм, представляющий механику в фазовом пространстве координат и импульсов. Он стал основой для перехода к квантовой механике и теории поля.",
  "celestial": "Раздел механики, изучающий движение планет, спутников и других небесных тел под действием гравитации. Исторически стал первым примером точного математического описания природы.",
  "phase_transitions": "Процессы изменения агрегатного состояния вещества, сопровождающиеся скачкообразным изменением физических свойств и симметрий системы.",
  "nuclear_physics": "Раздел физики, изучающий строение атомных ядер, ядерные силы, радиоактивные распады и ядерные реакции.",
  "hydrodynamics": "Раздел механики сплошных сред, описывающий движение жидкостей и газов как непрерывных сред с распределёнными параметрами.",
  "navier_stokes": "Фундаментальные нелинейные уравнения, описывающие движение вязкой жидкости. Их решения лежат в основе аэродинамики и гидродинамики, но остаются математически сложной задачей.",
  "archaeophysics": "Междисциплинарная область, применяющая методы физики для анализа археологических объектов, датирования и реконструкции древних технологий.",
  "wave_characteristics": "Набор параметров, полностью описывающих волновой процесс: амплитуда, длина волны, период, частота и скорость распространения.",
  "amplitude": "Максимальное отклонение колеблющейся физической величины от положения равновесия, связанное с энергией колебаний.",
  "wavelength": "Пространственный период волны — расстояние между двумя точками, находящимися в одинаковой фазе колебаний.",
  "phase_velocity": "Скорость распространения фазы волны, определяющая перемещение волнового фронта в пространстве.",
  "surface_tension": "Физическая величина, характеризующая энергию поверхности жидкости и силы, действующие вдоль границы раздела фаз.",
  "pendulum_types": "Классификация колебательных систем, в которых движение определяется действием восстанавливающего момента, возникающего из-за гравитации или упругости.",
  "phys_pendulum": "Маятник, представляющий собой твёрдое тело, совершающее колебания вокруг неподвижной оси под действием силы тяжести.",
  "math_pendulum": "Идеализированная модель маятника, состоящая из материальной точки на невесомой нерастяжимой нити, используемая для анализа простых колебаний.",
  "torsion_pendulum": "Колебательная система, в которой восстанавливающий момент обусловлен упругим кручением нити или стержня.",
  "spring_pendulum": "Гармонический осциллятор, в котором восстанавливающая сила возникает за счёт упругой деформации пружины.",
  "oscillation_params": "Совокупность физических величин, описывающих колебательный процесс, включая амплитуду, период, частоту и фазу.",
  "oscillation_period": "Временной интервал, за который система совершает одно полное колебание и возвращается в исходное состояние.",
  "angular_frequency": "Циклическая частота колебаний, пропорциональная скорости изменения фазы и связанная с периодом колебаний.",
  "frequency": "Физическая величина, показывающая, сколько полных колебаний или повторяющихся процессов происходит за единицу времени. Частота используется для описания механических, акустических, электромагнитных и квантовых явлений и отражает темп изменения системы.",
  "em_oscillations": "Колебательные процессы, при которых электрическое и магнитное поля периодически преобразуются друг в друга. Такие колебания возникают в электрических контурах и лежат в основе радиосвязи, электроники и электромагнитных волн.",
  "em_period": "Временной интервал одного полного электромагнитного колебания. Он характеризует повторяемость процесса и обратно пропорционален частоте, задавая временной масштаб колебательной системы.",
  "resonance_frequency": "Собственная частота системы, при которой внешнее воздействие приводит к наибольшей амплитуде колебаний. Резонанс отражает эффективный обмен энергией между источником и системой и играет ключевую роль в физике и технике.",
  "wave_speeds": "Скорости, с которыми распространяются волновые возмущения в различных средах. Они зависят от физических свойств среды и типа волны и определяют, как быстро передается энергия и информация.",
  "sound_speed_gas": "Скорость распространения звуковых волн в газе, определяемая температурой, составом и термодинамическим состоянием среды. Она отражает способность газа передавать упругие возмущения.",
  "electricity_speed": "Характерная скорость распространения электромагнитных сигналов и изменений напряжения в электрических цепях и линиях передачи. Обычно близка к скорости света, но зависит от свойств среды и конструкции.",
  "em_wave_speed": "Скорость распространения электромагнитных волн в веществе, меньшая скорости света в вакууме и определяемая электрическими и магнитными свойствами среды.",
  "phase_wave_speed": "Скорость перемещения фазы волны в пространстве. Она может отличаться от скорости переноса энергии и зависит от частоты при наличии дисперсии.",
  "wave_effects": "Совокупность физических явлений, проявляющихся благодаря волновой природе процессов, включая интерференцию, дифракцию, дисперсию и изменение частоты при движении источника или наблюдателя.",
  "doppler_effect": "Физическое явление изменения наблюдаемой частоты и длины волны при относительном движении источника и наблюдателя. Используется в астрономии, радиолокации, медицине и акустике.",
  "pause_law": "Учебный и вспомогательный термин, применяемый для описания участков колебательного процесса с медленным изменением фазы или амплитуды. Не относится к фундаментальным физическим законам.",
  "period_frequency": "Базовое соотношение, связывающее период и частоту как взаимно обратные величины, отражающее двойственное описание временной структуры колебательных процессов.",
  "wave_speed_relation": "Фундаментальная связь между скоростью волны, её длиной и частотой, показывающая, как временные и пространственные характеристики волны согласованы между собой.",
  "medium_properties": "Физические характеристики среды, такие как плотность, упругость, вязкость и электромагнитные параметры, которые определяют скорость распространения и затухание волн.",
  "wave_relations": "Соотношения между параметрами волн, возникающие при дисперсии, отражении, преломлении и других граничных условиях, определяющие поведение волновых процессов.",
  "light_characteristics": "Совокупность физических параметров света, включая частоту, длину волны, скорость распространения, интенсивность и поляризацию, используемых для его количественного и качественного описания.",
  "wavelength_visible": "Диапазон длин волн электромагнитного излучения, воспринимаемого человеческим глазом как видимый свет, лежащий между инфракрасной и ультрафиолетовой областями.",
  "wave_number": "Спектральная характеристика волны, обратная длине волны с точностью до множителя 2π, широко используемая в аналитической и квантовой теории волн.",
  "light_intensity": "Физическая величина, характеризующая мощность светового излучения, приходящуюся на единицу площади или телесного угла, и отражающая энергетическую насыщенность светового потока.",
  "refractive_index": "Безразмерная величина, показывающая, во сколько раз скорость света в вакууме превышает скорость света в данной среде, и определяющая степень преломления.",
  "photometric_quantities": "Набор величин, используемых для количественного описания света с учётом зрительного восприятия человека, включая световой поток, силу света, яркость и освещённость.",
  "light_sources": "Физические и фотометрические характеристики объектов, испускающих свет, определяющие спектр, интенсивность и направленность излучения.",
  "luminous_intensity": "Фотометрическая величина, характеризующая световой поток, излучаемый источником в заданном направлении, и отражающая направленность излучения.",
  "luminosity": "Полная световая мощность источника, определяемая суммарным световым потоком и используемая для сравнения источников по их излучательной способности.",
  "brightness": "Фотометрическая характеристика, описывающая интенсивность излучения с поверхности в определённом направлении, тесно связанная с визуальным восприятием.",
  "illuminance": "Величина, показывающая, какое количество светового потока падает на единицу площади поверхности, и используемая при расчётах освещения.",
  "lens_characteristics": "Совокупность параметров линз, определяющих их способность преломлять свет и формировать изображения, включая форму, материал и геометрию.",
  "optical_params": "Набор физических величин, описывающих свойства оптической системы, такие как фокусное расстояние, оптическая сила и апертура.",
  "focal_length": "Характерное расстояние линзы или оптической системы, определяющее положение фокуса для параллельных световых лучей.",
  "optical_power": "Мера преломляющей способности оптической системы, обратно пропорциональная фокусному расстоянию и широко применяемая в прикладной оптике.",
  "angular_characteristics": "Параметры, описывающие угловые свойства оптических систем и излучения, включая поле зрения и угловое разрешение.",
  "spatial_params": "Пространственные характеристики световых пучков и оптических систем, описывающие размеры, формы и распределения интенсивности.",
  "solid_angle": "Геометрическая величина, обобщающая понятие угла на трёхмерное пространство и используемая для описания направленных потоков излучения.",
  "light_laws": "Совокупность фундаментальных закономерностей, описывающих распространение, отражение, преломление и поглощение света.",
  "malus_law": "Закон, описывающий зависимость интенсивности линейно поляризованного света после анализатора от угла между плоскостями поляризации.",
  "wien_law": "Физический закон, связывающий температуру излучающего тела с длиной волны, на которой спектр излучения достигает максимума.",
  "rayleigh_jeans": "Классическое выражение для спектральной плотности теплового излучения в длинноволновой области, сыгравшее важную роль в развитии квантовой теории.",
  "light_relations": "Соотношения, связывающие фотометрические величины между собой и с геометрией излучения, используемые в прикладных расчётах освещения.",
  "intensity_angle": "Связь между силой света, телесным углом и световым потоком, отражающая направленный характер излучения.",
  "illuminance_intensity": "Зависимость освещённости поверхности от силы света источника и пространственного расположения объектов.",
  "brightness_luminosity": "Соотношение между яркостью и светимостью протяжённых источников, учитывающее площадь и распределение излучения.",
  "nuclear_characteristics": "Совокупность физических параметров атомных ядер, включая массу, заряд, спин, магнитный момент и энергию связи, определяющих их структуру и поведение.",
  "gyromagnetic_ratio": "Характеристика, связывающая магнитный момент частицы или ядра с её механическим моментом, играющая ключевую роль в магнитном резонансе.",
  "nuclear_magnetic_moment": "Магнитное свойство ядра, обусловленное спинами и движением нуклонов, и используемое для исследования ядерной структуры.",
  "diffusion_phenomena": "Процессы самопроизвольного переноса вещества, возникающие вследствие теплового хаотического движения частиц и приводящие к выравниванию концентраций.",
  "diffusion_equation": "Дифференциальное уравнение, описывающее пространственно-временную эволюцию концентрации вещества в результате диффузии. Оно формализует процесс самопроизвольного переноса частиц из областей с высокой концентрацией в области с низкой концентрацией за счёт их хаотического теплового движения. Уравнение диффузии является фундаментальной моделью неравновесных процессов переноса и применяется в физике, химии, биологии и инженерных науках.",
  "nuclear_relations": "Совокупность физических и математических соотношений между основными характеристиками атомных ядер, включая массу, заряд, спин, магнитный момент и энергию связи. Эти соотношения отражают внутреннюю структуру ядра и взаимодействия нуклонов и используются для интерпретации ядерных спектров, анализа стабильности ядер и описания ядерных реакций.",
  "moment_ratio_relation": "Физическая связь между магнитным моментом ядра и его гиромагнитным отношением, отражающая распределение зарядов и спинов внутри ядра. Данное соотношение играет важную роль в ядерной магнитной резонансной спектроскопии и позволяет получать информацию о микроскопической структуре ядра.",
  "diffusion_applications": "Применение диффузионных моделей для описания процессов переноса вещества, тепла и импульса в различных средах. Диффузионный подход используется при анализе теплопроводности, массопереноса, химических реакций, биологических процессов, а также при моделировании инженерных и природных систем.",
  "electric_charge": "Фундаментальное свойство элементарных частиц, определяющее их способность участвовать в электромагнитных взаимодействиях. Электрический заряд является дискретной величиной, подчиняется строгому закону сохранения и лежит в основе всей электрической, магнитной и электродинамической физики.",
  "electric_fields": "Физические поля, создаваемые электрическими зарядами и изменяющимися магнитными полями, в которых на заряды действует электрическая сила. Понятие электрического поля позволяет описывать электромагнитные взаимодействия как распределённые в пространстве процессы, а не как мгновенное действие на расстоянии.",
  "circuit_laws": "Совокупность фундаментальных законов и правил, позволяющих количественно анализировать токи, напряжения и мощности в электрических цепях. Эти законы основаны на сохранении электрического заряда и энергии и применимы к широкому классу стационарных и квазистационарных электрических систем.",
  "capacitance": "Физическая величина, характеризующая способность электрической системы накапливать заряд при заданной разности потенциалов. Ёмкость определяется геометрией системы, взаимным расположением проводников и свойствами диэлектрической среды между ними.",
  "biot_savart": "Закон классической электродинамики, описывающий вклад элементарного участка проводника с током в создаваемое им магнитное поле. Он является основой для вычисления магнитных полей сложных токовых конфигураций и играет важную роль в теории магнитных систем.",
  "ohm_law": "Фундаментальный эмпирический закон, устанавливающий линейную зависимость между силой электрического тока, напряжением и сопротивлением в проводнике при неизменных внешних условиях. Закон Ома лежит в основе анализа и проектирования электрических цепей.",
  "faraday_law": "Закон электромагнитной индукции, описывающий возникновение электродвижущей силы в замкнутом контуре при изменении магнитного потока через него. Этот закон является фундаментом современной электротехники и энергетики.",
  "kirchhoff_laws": "Два универсальных закона электрических цепей, выражающие сохранение заряда в узлах цепи и сохранение энергии в замкнутых контурах. Они позволяют анализировать сложные электрические сети независимо от их конкретного устройства.",
  "lorentz_force": "Сила, действующая на электрически заряженную частицу в электрическом и магнитном полях. Она определяет траектории движения зарядов в полях и лежит в основе работы электронных приборов, ускорителей частиц и плазменных систем.",
  "resistance": "Физическая характеристика проводника, количественно описывающая его способность препятствовать прохождению электрического тока. Сопротивление зависит от материала, геометрических размеров проводника и температуры.",
  "capacitors": "Электрические устройства, предназначенные для накопления электрического заряда и энергии в электрическом поле. Конденсаторы широко используются в электронике, энергетике и системах обработки сигналов.",
  "emf": "Электродвижущая сила, характеризующая способность источника тока совершать работу по переносу электрических зарядов. Она определяется природой источника и не равна напряжению на его зажимах при протекании тока.",
  "power": "Физическая величина, характеризующая скорость передачи, преобразования или потребления электрической энергии. Электрическая мощность является ключевым параметром при анализе и проектировании энергетических систем.",
  "energy_density": "Величина, показывающая количество энергии, заключённой в электромагнитном поле в единице объёма пространства. Используется при анализе распространения энергии и взаимодействия полей с веществом.",
  "h_theorem": "Статистическое утверждение, сформулированное Больцманом, описывающее необратимое стремление газовой системы к термодинамическому равновесию. H-теорема дала микроскопическое обоснование второго начала термодинамики.",
  "gas_laws": "Совокупность эмпирических и теоретических законов, устанавливающих связи между давлением, объёмом и температурой газа. Эти законы стали основой классической термодинамики и молекулярно-кинетической теории.",
  "boyle_mariotte": "Закон, описывающий изотермический процесс в газе, при котором произведение давления на объём остаётся постоянным. Он отражает обратную связь между плотностью газа и его давлением.",
  "charles_law": "Закон, устанавливающий пропорциональность объёма газа его абсолютной температуре при постоянном давлении, что отражает рост средней кинетической энергии молекул.",
  "dalton_law": "Закон парциальных давлений, согласно которому общее давление смеси газов равно сумме давлений, которые каждый газ создавал бы отдельно при той же температуре и объёме.",
  "molecular_motion": "Хаотическое тепловое движение молекул и атомов, являющееся микроскопической причиной давления, температуры и других макроскопических свойств вещества.",
  "mean_free_path": "Среднее расстояние, проходимое частицей между последовательными столкновениями, определяющее характер переноса импульса и энергии в газах.",
  "molecular_speeds": "Статистическое распределение скоростей молекул в газе, отражающее его термодинамическое состояние и описываемое законами статистической физики.",
  "state_equations": "Математические соотношения, связывающие макроскопические параметры состояния вещества и позволяющие предсказывать его поведение при изменении внешних условий.",
  "clausius_clapeyron": "Термодинамическое уравнение, описывающее зависимость давления насыщенного пара от температуры и определяющее линии фазового равновесия между различными агрегатными состояниями.",
  "mendeleev_clapeyron": "Уравнение состояния идеального газа, объединяющее основные газовые законы и устанавливающее связь между давлением, объёмом, температурой и количеством вещества.",
  "humidity": "Количественная характеристика содержания водяного пара в газовой смеси, оказывающая существенное влияние на тепловые, климатические и физиологические процессы.",
  "absolute_humidity": "Масса водяного пара, содержащаяся в единице объёма воздуха, используемая для строгого количественного описания влажности.",
  "heat_quantity": "Энергия, передаваемая системе в процессе теплопередачи, величина процессная, зависящая от пути изменения состояния системы.",
  "current_interaction": "Силовое взаимодействие между электрическими токами, обусловленное их магнитными полями и лежащее в основе электродинамических явлений.",
  "fundamental_constants": "Набор универсальных физических величин, численные значения которых определяют масштабы и связи фундаментальных процессов в природе.",
  "g_constant": "Фундаментальная гравитационная постоянная, определяющая интенсивность гравитационного взаимодействия в классической теории тяготения.",
  "free_fall_accel": "Ускорение, приобретаемое телом при свободном падении в гравитационном поле Земли, зависящее от высоты и географического положения.",
  "bohr_radius": "Характерный масштаб атома водорода, определяющий размер первой стационарной орбиты электрона в модели Бора.",
  "proton_mass": "Масса протона как фундаментальная физическая константа, определяющая масштаб ядерных и атомных процессов.",
  "neutron_mass": "Масса нейтрона, играющая ключевую роль в ядерной структуре, стабильности ядер и процессах ядерных реакций.",
  "electron_mass": "Масса электрона, фундаментальная константа микрофизики, определяющая размеры атомов и энергетические масштабы квантовых явлений.",
  "planck_constant": "Фундаментальная физическая постоянная, задающая масштаб квантования энергии и определяющая переход от классической к квантовой физике.",
  "fine_structure": "Безразмерная фундаментальная константа, характеризующая относительную силу электромагнитного взаимодействия и структуру атомных спектров.",
  "elementary_charge": "Минимальная порция электрического заряда, равная по модулю заряду электрона и протона, служащая базовой единицей электрического заряда.",
  "speed_of_light": "Фундаментальная физическая константа, равная скорости распространения электромагнитных волн в вакууме и являющаяся предельной скоростью передачи информации.",
  "avogadro_number": "Фундаментальная константа, связывающая макроскопическое количество вещества с числом элементарных частиц.",
  "gas_constant": "Универсальная газовая постоянная, определяющая энергетический масштаб термодинамических процессов в идеальном газе.",
  "quantum_basics": "Совокупность фундаментальных принципов квантовой физики, включающих квантование физических величин, суперпозицию состояний и вероятностный характер измерений.",
  "wave_particle": "Принцип корпускулярно-волнового дуализма, согласно которому микроскопические объекты проявляют как волновые, так и частичные свойства.",
  "schrodinger": "Основное уравнение нерелятивистской квантовой механики, определяющее временную эволюцию волновой функции системы.",
  "uncertainty": "Фундаментальные соотношения, ограничивающие одновременную точность измерения сопряжённых физических величин и отражающие неклассическую природу микромира.",
  "wave_function": "Комплексная функция, полностью описывающая квантовое состояние системы и определяющая вероятности возможных результатов измерений.",
  "hilbert_space": "Абстрактное математическое пространство, в котором формализуются состояния квантовой системы и операции над ними.",
  "atomic_physics": "Раздел квантовой физики, изучающий строение атомов, их энергетические уровни, спектры и взаимодействие с электромагнитным излучением.",
  "bohr_model": "Полуклассическая модель атома, в которой движение электрона описывается квантованными орбитами, позволившая объяснить спектр водорода.",
  "quantum_numbers": "Дискретные параметры, определяющие допустимые квантовые состояния атомных и ядерных систем.",
  "electron_spin": "Внутренний угловой момент электрона, не имеющий классического аналога, и связанный с ним собственный магнитный момент.",
  "pauli": "Принцип запрета Паули — фундаментальное квантовое утверждение, согласно которому два идентичных фермиона не могут одновременно находиться в одном и том же квантовом состоянии. Этот принцип не выводится из классических представлений и отражает глубинную квантовую природу материи. Он лежит в основе электронной структуры атомов, периодической системы элементов, устойчивости вещества и макроскопических свойств фермионных систем.",
  "quantum_effects": "Совокупность физических явлений, возникающих вследствие квантовой природы материи и поля. Квантовые эффекты включают дискретность энергетических уровней, волновые свойства частиц, туннелирование, запутанность и вероятностный характер измерений. Они проявляются на микроскопических масштабах и принципиально отличают квантовую физику от классической.",
  "tunneling": "Квантовый эффект, при котором частица имеет ненулевую вероятность прохождения через потенциальный барьер, который она не могла бы преодолеть согласно классической механике. Туннелирование является прямым следствием волновой природы частиц и играет ключевую роль в ядерных процессах, полупроводниковой физике и квантовой электронике.",
  "entanglement": "Фундаментальное квантовое явление, при котором состояния нескольких подсистем оказываются неразделимо связанными, так что описание каждой из них невозможно независимо от других. Квантовая запутанность приводит к корреляциям, не объяснимым классическими вероятностными теориями, и является центральным элементом квантовой информации и философии квантовой механики.",
  "superposition": "Базовый принцип квантовой механики, согласно которому квантовая система может находиться в линейной комбинации нескольких возможных состояний одновременно. Физический смысл суперпозиции проявляется при измерении, когда система проявляет одно из возможных состояний с определённой вероятностью. Этот принцип лежит в основе интерференции и квантовых вычислений.",
  "aharonov_bohm": "Квантовый эффект, демонстрирующий физическую значимость электромагнитных потенциалов. Он проявляется в зависимости фазы волновой функции заряженной частицы от магнитного потенциала даже в областях, где магнитное поле равно нулю. Эффект Ааронова–Бома подчёркивает неклассический характер квантовой теории и фундаментальную роль потенциалов.",
  "qft": "Квантовая теория поля — обобщённая теоретическая рамка, объединяющая квантовую механику и специальную теорию относительности. В ней элементарные частицы рассматриваются как кванты возбуждений фундаментальных полей. КТП является основой современной физики элементарных частиц и описания фундаментальных взаимодействий.",
  "qed": "Квантовая электродинамика — квантовая теория электромагнитного взаимодействия, описывающая взаимодействие заряженных частиц через обмен квантами электромагнитного поля — фотонами. Она стала первой полностью согласованной и перенормируемой квантовой теорией поля и одной из наиболее точно проверенных физических теорий.",
  "qcd": "Квантовая хромодинамика — квантовая теория сильного взаимодействия, описывающая взаимодействие кварков и глюонов посредством цветного заряда. Она объясняет структуру адронов, конфайнмент кварков и асимптотическую свободу, формируя современное понимание ядерных сил.",
  "standard_model": "Стандартная модель элементарных частиц — калибровочная квантово-полевая теория, объединяющая электрослабое и сильное взаимодействия. Она систематизирует известные элементарные частицы и их взаимодействия, за исключением гравитации, и служит фундаментом современной физики микромира.",
  "higgs": "Бозон Хиггса — квантовое возбуждение поля Хиггса, связанного с механизмом спонтанного нарушения симметрии. Этот механизм объясняет происхождение масс элементарных частиц в рамках Стандартной модели и завершает её внутреннюю структуру.",
  "quantum_apps": "Совокупность научных и технологических применений квантовой физики, основанных на управлении квантовыми состояниями, когерентностью и корреляциями. К ним относятся квантовые вычисления, связь, сенсоры, новые материалы и методы обработки информации.",
  "quantum_computing": "Вычислительная парадигма, использующая квантовые биты — кубиты, способные находиться в суперпозиции и запутанных состояниях. Квантовые вычисления позволяют эффективно решать определённые классы задач, практически недоступные для классических компьютеров.",
  "quantum_crypto": "Раздел криптографии, основанный на фундаментальных принципах квантовой механики, прежде всего на невозможности незаметного измерения квантового состояния. Квантовая криптография обеспечивает теоретически гарантированную безопасность передачи информации.",
  "quantum_sensors": "Высокочувствительные измерительные устройства, использующие квантовые эффекты, такие как когерентность и запутанность, для достижения предельной точности измерений времени, полей, ускорений и других физических величин.",
  "dirac_equation": "Релятивистское волновое уравнение для частиц со спином 1/2, объединяющее квантовую механику и специальную теорию относительности. Уравнение Дирака предсказало существование античастиц и заложило основу современной релятивистской квантовой теории.",
  "quantum_thermo": "Раздел физики, изучающий термодинамические процессы в малых квантовых системах, где существенную роль играют квантовая когерентность, корреляции и информация. Квантовая термодинамика расширяет классические понятия работы, тепла и энтропии.",
  "quantum_optics": "Раздел квантовой физики, исследующий квантовые свойства света и его взаимодействие с веществом. Квантовая оптика изучает фотоны, неклассические состояния света и фундаментальные процессы излучения и поглощения.",
  "particle_physics": "Раздел фундаментальной физики, изучающий элементарные частицы, их свойства, классификацию и фундаментальные взаимодействия. Физика частиц направлена на выявление наиболее глубоких законов природы.",
  "quantum_coherence": "Сохранение определённых фазовых соотношений между квантовыми состояниями системы, обеспечивающее интерференционные эффекты. Квантовая когерентность является ключевым ресурсом квантовых технологий и чувствительна к взаимодействию с окружением.",
  "quantum_chaos": "Междисциплинарная область, исследующая проявления хаотического поведения в квантовых системах и связь между квантовой динамикой и классическим хаосом.",
  "quantum_fluids": "Квантовые состояния вещества, такие как сверхтекучие жидкости и бозе-конденсаты, в которых макроскопические свойства определяются коллективными квантовыми эффектами.",
  "quantum_algorithms": "Алгоритмы обработки информации, использующие квантовую суперпозицию и запутанность для ускорения вычислений по сравнению с классическими методами.",
  "topological_insulators": "Класс квантовых материалов, в которых объём является изолятором, а поверхностные состояния проводящи и защищены топологическими свойствами электронной структуры.",
  "feynman_path": "Формулировка квантовой механики, в которой вероятность перехода между состояниями представляется как сумма вкладов по всем возможным траекториям. Этот подход подчёркивает вероятностный и недетерминированный характер квантовой динамики.",
  "atomic_structure": "Квантовое описание атома как системы ядра и электронов, взаимодействующих посредством электромагнитного поля и обладающих дискретными энергетическими уровнями.",
  "quantum_moments": "Квантовые угловые моменты и связанные с ними магнитные моменты, возникающие как фундаментальные характеристики микроскопических систем.",
  "orbital_moment": "Орбитальный угловой момент электрона, связанный с его движением вокруг ядра и принимающий дискретные значения в квантовой механике.",
  "spin_moment": "Спиновый угловой момент — внутреннее квантовое свойство частиц, не имеющее классического аналога и сопровождающееся собственным магнитным моментом.",
  "photon_properties": "Совокупность физических характеристик фотона как кванта электромагнитного поля, включая энергию, импульс, спин и поляризацию.",
  "photon_energy": "Квантовое соотношение, связывающее энергию фотона с его частотой, отражающее дискретный характер обмена энергией между светом и веществом.",
  "compton_wavelength": "Характерная длина, связанная с массой частицы, определяющая масштаб релятивистских квантовых эффектов и проявляющаяся в рассеянии излучения.",
  "planck_formula": "Квантовый закон распределения энергии излучения абсолютно чёрного тела по частотам, положивший начало квантовой физике и преодолевший противоречия классической теории.",
  "special": "Специальная теория относительности — теория пространства и времени для инерциальных систем отсчёта, основанная на принципе относительности и постоянстве скорости света.",
  "postulates": "Два фундаментальных постулата специальной теории относительности: эквивалентность всех инерциальных систем отсчёта и инвариантность скорости света в вакууме.",
  "effects": "Совокупность физических следствий специальной теории относительности, включая замедление времени, сокращение длины и изменение динамики при высоких скоростях.",
  "dilation": "Релятивистский эффект замедления хода времени для движущихся часов относительно неподвижного наблюдателя.",
  "length_contraction": "Эффект сокращения длины объектов в направлении их движения при релятивистских скоростях.",
  "energy_momentum": "Релятивистское соотношение между энергией, импульсом и массой, объединяющее классические законы сохранения в единую формулу.",
  "general": "Общая теория относительности — геометрическая теория гравитации, описывающая гравитационные явления как искривление пространства-времени под действием материи и энергии.",
  "equivalence": "Принцип эквивалентности, утверждающий неразличимость гравитационных и инерциальных эффектов и лежащий в основе геометрической интерпретации гравитации.",
  "einstein_eq": "Система уравнений, связывающая геометрию пространства-времени с распределением энергии и импульса материи.",
  "black_holes": "Экстремальные решения уравнений общей теории относительности, характеризующиеся наличием горизонта событий, за пределами которого невозможен выход информации.",
  "grav_waves": "Гравитационные волны — распространяющиеся возмущения геометрии пространства-времени, возникающие при ускоренном движении массивных тел.",
  "cosmology": "Раздел физики и астрономии, изучающий строение, происхождение и эволюцию Вселенной в целом на основе общей теории относительности.",
  "dark_matter": "Гипотетическая форма материи, не взаимодействующая электромагнитно и обнаруживаемая по своим гравитационным эффектам в космологии и астрофизике.",
  "dark_energy": "Гипотетическая форма энергии, ответственная за ускоренное расширение Вселенной и определяющая её крупномасштабную динамику.",
  "universe_evolution": "Эволюция Вселенной — это процесс изменения её физических свойств во времени, включающий расширение пространства, формирование элементарных частиц, атомов, звёзд, галактик и крупномасштабных структур. Современное описание основано на общей теории относительности и космологических моделях, связывающих динамику расширения с составом материи и энергии.",
  "cosmic_rays": "Космические лучи представляют собой потоки высокоэнергетических частиц внеземного происхождения, преимущественно протонов и ядер, достигающих Земли из межзвёздного и межгалактического пространства. Их изучение позволяет исследовать процессы в астрофизических источниках экстремальных энергий и фундаментальные взаимодействия.",
  "gps_systems": "Системы глобального позиционирования — это навигационные технологии, основанные на точном измерении времени распространения сигналов от спутников. Их корректная работа требует учёта релятивистских эффектов, таких как замедление времени и гравитационный сдвиг частоты, предсказанных теорией относительности.",
  "lorenz": "Преобразования Лоренца — это математические соотношения между координатами и временем событий в различных инерциальных системах отсчёта. Они сохраняют пространственно-временной интервал и лежат в основе специальной теории относительности, заменяя классические преобразования Галилея.",
  "holographic_principle": "Голографический принцип — теоретическая гипотеза, согласно которой вся информация, содержащаяся в объёме пространства, может быть эквивалентно описана на его границе. Этот принцип возник из исследований термодинамики чёрных дыр и играет важную роль в теориях квантовой гравитации.",
  "quantum_tech": "Квантовые технологии — это область инженерии и науки, направленная на использование управляемых квантовых состояний для создания новых вычислительных, коммуникационных и измерительных устройств. Их развитие стало возможным благодаря прогрессу в квантовой физике и экспериментальных методах контроля микросистем.",
  "quantum_information": "Квантовая информация — междисциплинарная область, изучающая представление, передачу и обработку информации в квантовых системах. Она расширяет классическую теорию информации, включая такие ресурсы, как суперпозиция и квантовая запутанность.",
  "quantum_simulators": "Квантовые симуляторы — это специализированные физические системы, предназначенные для моделирования поведения сложных квантовых объектов, которые трудно описывать классическими вычислительными методами. Они позволяют исследовать фазовые переходы, корреляции и динамику квантовых систем.",
  "quantum_gravity": "Квантовая гравитация — теоретическая программа, направленная на создание согласованной теории, объединяющей квантовую механику и гравитацию. Её целью является описание структуры пространства-времени на планковских масштабах, где классические представления теряют применимость.",
  "string_theory": "Теория струн — это теоретический подход, в котором элементарные частицы интерпретируются как различные колебательные состояния одномерных объектов — струн. Теория стремится объединить все фундаментальные взаимодействия, включая гравитацию, в единую квантовую схему.",
  "loop_gravity": "Петлевая квантовая гравитация — это подход к квантованию гравитации, в котором пространство-время рассматривается как дискретная структура, состоящая из элементарных квантов геометрии. Теория не требует дополнительных измерений и напрямую опирается на общую теорию относительности.",
  "beyond_standard": "Физика за пределами Стандартной модели включает теоретические и экспериментальные попытки объяснить явления, не укладывающиеся в существующую модель частиц и взаимодействий, такие как тёмная материя, нейтринные массы и иерархия масштабов.",
  "neutrino": "Физика нейтрино изучает свойства этих слабо взаимодействующих частиц, включая их массы, смешивание и осцилляции. Исследования нейтрино сыграли ключевую роль в выявлении ограничений Стандартной модели и указали на необходимость её расширения.",
  "multiverse": "Гипотеза мультивселенной предполагает существование множества вселенных с различными физическими параметрами и законами. Она возникает в некоторых моделях инфляции и теории струн, однако остаётся философски и экспериментально спорной.",
  "medical_physics": "Медицинская физика — прикладная область, использующая физические методы и принципы для диагностики, терапии и контроля в медицине. Она включает радиационную физику, визуализацию, дозиметрию и разработку медицинского оборудования.",
  "mri_technology": "Магнитно-резонансная томография — метод медицинской визуализации, основанный на явлении ядерного магнитного резонанса. Он позволяет получать детальные изображения внутренних структур организма без ионизирующего излучения.",
  "neurophysics": "Нейрофизика применяет физические модели и методы к изучению процессов в нервной системе, включая электрическую активность нейронов, распространение сигналов и коллективную динамику нейронных сетей.",
  "tech_control": "Контроль технологий — это область анализа и управления рисками, связанными с развитием физических и инженерных технологий. Она включает вопросы безопасности, этики, ответственности и социального воздействия научных достижений.",
  "solar_cells": "Солнечные элементы — устройства, преобразующие энергию света в электрическую энергию на основе фотоэлектрических и полупроводниковых процессов. Их физика опирается на квантовую теорию твёрдого тела и электродинамику.",
  "fusion": "Термоядерный синтез — процесс слияния лёгких ядер с выделением энергии, лежащий в основе энергетики звёзд. Попытки управляемой реализации синтеза направлены на создание нового источника энергии.",
  "superconductivity": "Сверхпроводимость — квантовое явление, при котором электрическое сопротивление материала исчезает, а магнитное поле вытесняется из его объёма. Оно связано с коллективными квантовыми состояниями электронов.",
  "semiconductors": "Полупроводники — класс материалов, проводимость которых может управляться внешними воздействиями. Их физика стала основой современной электроники, вычислительной техники и фотоники.",
  "neutron_stars": "Нейтронные звёзды — компактные астрофизические объекты, образующиеся при коллапсе массивных звёзд. Они характеризуются экстремальной плотностью вещества и сильными гравитационными и магнитными полями.",
  "particle_accelerators": "Ускорители частиц — установки, предназначенные для разгона элементарных частиц до высоких энергий. Они являются ключевыми инструментами экспериментальной физики частиц, медицины и материаловедения.",
  "accelerators": "Ускорители нового поколения ориентированы на повышение энергии, яркости пучков и компактности установок, а также на расширение прикладных и исследовательских возможностей.",
  "quantum_biology": "Квантовая биология исследует возможную роль квантовых эффектов, таких как когерентность и туннелирование, в биологических процессах. Это направление находится на стыке физики, химии и биологии.",
  "photosynthesis": "Современные исследования фотосинтеза показывают, что перенос энергии в фотосинтетических комплексах может включать квантовые и когерентные эффекты, повышающие эффективность процесса.",
  "magnetic_sense": "Магниторецепция — способность некоторых организмов ориентироваться в магнитном поле Земли. Существуют гипотезы, связывающие этот механизм с квантовыми процессами в биологических молекулах.",
  "ai_physics": "Применение методов искусственного интеллекта в физике включает анализ больших массивов данных, автоматизацию поиска закономерностей и ускорение моделирования сложных систем.",
  "chaos_theory": "Теория хаоса изучает детерминированные динамические системы, обладающие чувствительной зависимостью от начальных условий, что приводит к практически непредсказуемому поведению.",
  "scientific_status": "Философский анализ статуса науки рассматривает критерии научности, границы применимости теорий и роль науки в обществе и культуре.",
  "measurement_problem": "Проблема измерения в квантовой механике связана с согласованием непрерывной унитарной эволюции квантовой системы и дискретного результата измерения, включая вопрос о редукции волновой функции.",
  "time_nature": "Проблема природы времени исследует его онтологический статус, направленность и роль в фундаментальных физических теориях.",
  "consciousness": "Дискуссии о сознании в контексте физики касаются границ физического объяснения субъективного опыта и возможной роли квантовых процессов, оставаясь в значительной степени философскими.",
  "hierarchy": "Проблема иерархии масштабов связана с объяснением резких различий между фундаментальными энергетическими и массовыми параметрами в физике частиц.",
  "anthropic": "Антропный принцип используется как методологический инструмент для обсуждения значений фундаментальных констант и условий существования наблюдателей во Вселенной.",
  "time_arrow": "Проблема стрелы времени связана с объяснением направленности физических процессов и её связи с ростом энтропии и космологическими условиями.",
  "wave_collapse": "Коллапс волновой функции — гипотеза, описывающая переход от квантовой суперпозиции к определённому результату измерения и являющаяся ключевым элементом интерпретаций квантовой механики.",
  "spacetime_discrete": "Идея дискретности пространства-времени предполагает, что на фундаментальных масштабах геометрия может иметь квантовую, а не непрерывную структуру.",
  "local_realism": "Локальный реализм — совокупность предположений о независимом существовании физических свойств и ограничении влияний скоростью света, поставленная под сомнение квантовыми экспериментами.",
  "crisis_cosmology": "Кризис космологии обозначает современные расхождения между наблюдательными данными и стандартной космологической моделью, такие как напряжение в измерениях постоянной Хаббла.",
  "quantum_mind": "Квантовый разум — совокупность спекулятивных гипотез о роли квантовых процессов в сознании, не имеющих на данный момент общепринятого физического подтверждения.",
  "mass_defect": "Дефект массы — разность между суммарной массой нуклонов и массой ядра, отражающая энергию связи в соответствии с эквивалентностью массы и энергии.",
  "proton_mass_future": "Проблема происхождения массы протона связана с динамикой кварков и глюонов в квантовой хромодинамике и остаётся предметом активных исследований.",
  "decay_law": "Закон радиоактивного распада — статистическое утверждение об экспоненциальном уменьшении числа нестабильных ядер или частиц со временем.",
  "philosophy_core": "Философия физики представляет собой фундаментальный уровень осмысления научного знания, в котором исследуются основания, смысл и границы физических теорий. Она отвечает на вопросы о том, что считается реальностью, каков статус физических законов, какую роль играет наблюдатель и в какой мере математические конструкции отражают мир, а не лишь удобные модели его описания. Через онтологию, эпистемологию и философию науки философия физики связывает эксперимент, теорию и интерпретацию, формируя целостное мировоззрение, в котором физика выступает не только как набор формул, но как способ понимания бытия.",
  "classical_core": "Классическая физика — это фундамент научного описания природы, сформированный в XVII–XIX веках и определяющий интуитивное представление о мире. Она изучает движение тел, силы, энергию, тепло, волны и поля в условиях, где квантовые и релятивистские эффекты пренебрежимо малы. Законы Ньютона, термодинамика, классическая электродинамика и оптика создали детерминированную картину мира, в которой состояние системы в каждый момент времени однозначно определяется её предыдущим состоянием. Несмотря на ограничения применимости, классическая физика остаётся основой инженерии, техники и прикладных наук.",
  "quantum_core": "Квантовая физика описывает микромир — область атомов, элементарных частиц и фундаментальных взаимодействий, где классические представления о непрерывности и определённости теряют силу. В квантовой теории состояние системы задаётся волновой функцией, результаты измерений носят вероятностный характер, а явления суперпозиции и квантовой запутанности нарушают привычные представления о локальности и причинности. Квантовая физика не только лежит в основе современной микроэлектроники и квантовых технологий, но и ставит глубокие философские вопросы о природе реальности и роли наблюдателя.",
  "relativity_core": "Теория относительности радикально изменила понимание пространства, времени, массы и гравитации, объединив их в единую структуру пространства-времени. Специальная теория относительности показала относительность одновременности и фундаментальную роль скорости света, а общая теория относительности описала гравитацию как искривление пространства-времени под действием материи и энергии. Эти идеи легли в основу современной космологии и астрофизики, позволив объяснить эволюцию Вселенной, существование чёрных дыр и распространение гравитационных волн.",
  "future_core": "Будущее физики связано с выходом за пределы существующих теорий и поиском более глубинного описания природы. Попытки объединить квантовую механику и гравитацию, исследование тёмной материи и тёмной энергии, развитие квантовых вычислений и новых экспериментальных установок формируют новые направления науки. Физика будущего — это область смелых гипотез, математических конструкций и технологических прорывов, где границы между физикой, математикой и философией становятся всё менее чёткими.",
  "unknown_core": "Пропасть незнания обозначает область фундаментальных вопросов, на которые современная физика пока не имеет ответов или даже строгих формулировок. Это пределы применимости теорий, проблемы интерпретации, ограничения измеримости и вопросы о происхождении самих законов природы. Здесь находятся загадки времени, структуры реальности и возможных уровней физического описания за пределами наблюдаемого. Пропасть незнания служит не препятствием, а источником развития науки, указывая направления будущего поиска и расширения человеческого понимания.",
  "future_easter_egg": "Что ж, поздравлю, ты нашел мою точку отслыку, первое, что хочу сделать, так это поздравить тебя с этим достижением, уж не знаю, помогли тебе друзья или ты просто случайным образом на нее наткнулся, ну не суть, так важно, хочу выразить тебе, читатель моего писанья, большое спасибо, что вообще зашел на мой сайт, надеюсь, ты нашел, что искал, или просто тебе хотя бы было приятно посмотреть, что да как на моем сайте, если есть идеи, пиши, я всегда отвечаю.  "
}